# 概述

由于`MySQL`是作为存储层部署在业务系统的最后端，所有的业务数据最终都要写入数据库和写入磁盘中，但随着一个项目在线上运行的时间越来越就，那么数据库中的数据量自然就会越来越多，那么数据体量增大了，当需要从表查询一些数据时，效率就会越来越低。在正常情况下，表的查询性能和数据量是成反比的，也就是数据量越大，查询越慢

这个问题是`MySQL`默认查询方式导致的

举个案例：

> 对于这张学生表进行查询操作，假设我们要查询一个姓名是d的学生，`MySQL`底层会触发磁盘`IO`，对表中的数据进行逐条读取并判断，也就是说想要查询到指定的哪一行数据，至少需要发生4次磁盘`IO`才能找到要检索的目标（没有考虑局部性读取原理和随机`IO`）
>
> - 如果我们要查询的表有`1000w`条数据，那么如果要查询的目标是第`900w`行的数据，那我们是不是要进行`900w`次磁盘`IO`才能检索到目标数据，很显然是不可能这么干的，效率低得离谱
> - 其实`MySQL`默认的查询方式就是直接进行全表扫描操作，所以效率很低
>
> ~~~sql
> SELECT * FROM `student_table`;
> +------------+--------+------+--------+
> | student_id | name   | sex  | height |
> +------------+--------+------+--------+
> |          1 | a      | 男   | 185cm  |
> |          2 | b      | 女   | 170cm  |
> |          3 | c      | 男   | 182cm  |
> |          4 | d      | 男   | 187cm  |
> |          5 | e      | 男   | 177cm  |
> |          6 | f      | 男   | 178cm  |
> |          7 | g      | 女   | 165cm  |
> +------------+--------+------+--------+
> 
> SELECT * FROM `student_table`  WHERE name = "d"
> ~~~
>
> 而一般情况下，一个业务系统中，最频繁的操作就是查询数据库的操作，一般读写请求的比例都遵循所谓的三七定律，读占`70%`，写占`30%`，所以我们一定要提升数据库的查询性能

**那么我们应该如何去提升数据库的查询性能呢？**
举一个案例，一本字典，假如是新华字典，当我们想要去查询一个汉字的时候，我们不可能说从第一页一直翻找到我们的目标汉字的位置的，这个就是上面所说的全表扫描方式，效率很低，所以字典的侧边会给出首字母，音节，偏旁来加快我们的查询操作，这些就是字典的目录索引，通过目录索引就可以加快我们的查询操作的效率

同理，字典可以通过目录索引来提升查询效率，数据库的表一样可以创建合适的索引来提升查询效率，而且在`MySQL`中也提供了索引机制，索引是数据库中的核心组件之一，在一张表中建立了合适的索引之后，面对海量数据的时候能够事半功倍，所以接下来我们聊一下`MySQL`的索引

> 索引机制会分为上中下三篇进行阐述：
> 《上篇：索引初识篇》主要讲解索引的概述、分类、使用与管理
>
> 《中篇：索引应用篇》主要讲解索引优劣分析、建立索引的原则、索引失效的场景、如何正确使用索引、索引优化机制
>
> 《下篇：索引原理篇》主要讲解索引的底层实现，`B+Tree、Hash`数据结构、聚簇索引、非聚簇索引实现、索引查询原理、索引管理实现

---

# MySQL索引机制概述

经过上述例子的理解，`MySQL`索引就是为了加快检索到目标数据，那么`MySQL`的索引是如何使用的呢？首先就得创建索引，`MySQL`可以通过`create、alter、ddl`三种方式其中一种来创建索引，创建了才能使用

## MySQL索引的创建方式

- 使用`create`语句创建索引

  > 这种场创建方式可以给一张已经存在的表结构添加索引，即给一张已经被创建出来的表添加索引
  >
  > ~~~sql
  > CREATE INDEX indexName ON tableName (columnName(length) [ASC|DESC]);
  > ~~~
  >
  > 解释一下几个值的含义：
  >
  > - `indexName`：当前创建的这个索引，创建成功之后叫的名字
  > - `tableName`：指定表名，在哪一种表上创建一个索引
  > - `columnName`：指定字段名，要为表中的哪一个字段创建索引
  > - `length`：如果字段存储的值过长，选用值得前多少个字符创建索引
  > - `ASC|DESC`：指定索引的排序方式，`ASC`是升序，`DESC`是降序，默认是`ASC`
  >
  > 
  >
  > `INDEX`可以换成`KEY`，作用都是创建一个普通索引，还有一些其他的索引类型，后面再说

  

- 使用`ALTER`语句创建

  > 和上述`CREATE`语句的参数都相同
  >
  > ~~~sql
  > ALTER TABLE tableName ADD INDEX indexName(columnName(length) [ASC|DESC]);
  > ~~~
  >
  > - `tableName`：指定表名，在哪一种表上创建一个索引
  > - `indexName`：当前创建的这个索引，创建成功之后叫的名字
  > - `columnName`：指定字段名，要为表中的哪一个字段创建索引
  > - `length`：如果字段存储的值过长，选用值得前多少个字符创建索引
  > - `ASC|DESC`：指定索引的排序方式，`ASC`是升序，`DESC`是降序，默认是`ASC`

  

- 使用`DDL`语句创建
  注意：是建表时在`DDL`语句中创建，就是在创建表的时候顺带创建索引
  这种方式适合在创建表的时候就已经确定了索引项的情况下进行创建

  > ~~~sql
  > CREATE TABLE tableName(  
  >   columnName1 INT(8) NOT NULL,   
  >   columnName2 ....,
  >   .....,
  >   INDEX [indexName] (columnName(length))  
  > );
  > 
  > ~~~
  >
  > 参数也基本一样
  >
  > - `tableName`：指定表名，在哪一种表上创建一个索引
  > - `columnName`：指定字段名，要为表中的哪一个字段创建索引
  > - `indexName`：指定字段名，要为表中的哪一个字段创建索引
  > - `length`：如果字段存储的值过长，选用值得前多少个字符创建索引

---

## 查询、删除、指定索引

> 为`user_id`创建了一个主键索引
>
> ~~~sql
> create table mysql_index_study (
>     user_id int not null auto_increment,
>     user_name varchar(225) NULL DEFAULT '',
>     user_sex varchar(225) null default  '',
>     user_phone varchar(225) null default '',
>     primary key (user_id) using btree
> );
> 
> # 查询索引信息
> show index from mysql_index_study;
> ~~~

| Table             | Non_unique | Key_name | Seq_in_index | Column_name | Collation | Cardinality | Sub_part | Packed | Null | Index_type | Comment |
| ----------------- | ---------- | -------- | ------------ | ----------- | --------- | ----------- | -------- | ------ | ---- | ---------- | ------- |
| mysql_index_study | 0          | PRIMARY  | 1            | user_id     | A         | 0           | null     | null   |      | BTREE      |         |

解释一下每个字段的含义：

- `Table`：当前索引属于那张表，
- `Non_unique`：当前索引是否属于唯一索引，`0`代表是，`1`代表不是
- `Key_name`：当前索引的名字
- `Seq_in_index`：如果当前是联合索引，目前字段在联合索引中排第几个，
- `Column_name`：当前索引是在哪个字段上建立的
- `Collation`：字段值以什么方式存储在索引中，`A`表示有序存储`要么ACS，要么DESC`，`NULL`表示无序存储
- `Cardinality`：当前索引的散列程度，也就是索引中存储了多少个不同的值
- `Sub_part`：当前索引使用了字段值的多少个字符建立，`NULL`表示全部
- `Packed`：表示索引在存储字段值时，以什么方式进行压缩，`NULL`表示未压缩
- `Null`：当前作为索引字段的值中，是否存在`NULL`值，`YES`表示存在
- `Index_type`：当前索引的结构`BTREE、FULLTEXT、HASH、RTREE`
- `Comment`：创建索引时，是否对索引有备注信息

这条命令在后续排查问题、性能优化中起到很大作用，例如可以通过分析`Cardinality`字段值，如果该值少于数据的实际行数，那目前索引有可能失效，后续会讲

> 讲解完查询，那么我们看一下删除命令和指定索引的命令

在`MySQL`中没有提供修改索引的命令，如果你建错了索引，只能先删除再新建索引，删除索引语句：

~~~sql
drop index indexName on tableName;
~~~

创建一条索引后，也可以强制性地为`SELECT`语句指定索引，如下：
就是指定强制要使用哪个索引来进行查询操作

~~~sql
select * from table_name force index(index_name) where .....
~~~

`force index`关键字可以为一条查询语句强制指定查询的时候要使用哪一个索引进行查询操作

这个关键字的用法是：一条查询`SQL`在面临多个索引可以检索数据的时候，可以通过这个关键字来显式指定一个索引，减少了优化器选择索引的耗时

但是，要牢记：**如果这条查询`SQL`不走这个指定索引的字段，这种方式是行不通的**，即在查询的时候不包含这个创建索引的字段，这个强制使用索引这个方式是走不通的，是不会使用这个索引的

> 注意：如果你对你的业务系统十分熟悉，那可以这么干，但是如果不是很熟悉的话，那就不要这么干，老老实实交给优化器去选择出最优的执行计划就好了

---

## 数据库索引的本质

那么我们已经在前面讲过了怎么创建索引、怎么查询索引、怎么删除索引、怎么强制使用某个索引等操作，但是索引本质上在数据库中是什么呢？

数据库是基于磁盘进行工作的，所有的数据最终都会被写入到磁盘上进行存储，索引也是数据的一种，所以索引和表数据一样，最终都会被写入到磁盘上进行存储，生成本地文件

但是索引是以什么方式来进行存储的呢，这是由索引的数据结构来决定的，同时，由于索引机制最终由存储引擎实现，因此不同存储引擎下的索引文件其存储在本地的格式也是不一样的

> 注意：建立索引最好在表比较少的时候进行创建，因为表结构多了，创建索引的时间也会随之加长

为什么说要在表比较少的时候去创建索引呢？

因为索引本质上就是和表中的数据一样，都是磁盘中的本地文件，那么也就是说创建一个索引，并不像添加约束这么简单，而是基于原表中的数据，重新在磁盘中创建新的本地索引文件。

如果这个表中由`1000w`条数据，那么此时创建索引，就需要将索引对应字段上的`1000w`个值全部进行拷贝，拷贝到本地文件中，同时做好排序并和数据产生映射关系

---

# MySQL的索引分类

索引是有很多类型的，例如：聚簇索引、非聚簇索引、唯一索引、主键索引、联合索引、全文索引、单列索引、多列索引、复合索引、普通索引、二级索引、辅助索引、次级索引、有序索引、`B+Tree`索引、`R+Tree`索引、`T+Tree`索引、`Hash`索引、空间索引、前缀索引等

但实际上`MySQL`数据库中并没有这么多索引类型，有些不同称呼但是同一个索引，有些只是逻辑上的索引，那么接下来我们就对索引进行分类

## 数据结构层次

索引建立之后会在磁盘生成索引文件，哪每个具体的索引节点又应该在本地文件中如何存储呢。是由索引的数据结构来决定的。。例如索引的数据结构是数组类型，那所有的索引节点都会以`Node1->Node2->Node3.....`这样子的形式进行存储，存储在和磁盘同一块的物理空间中，但是`MySQL`是不支持数组结构的，只是简单举个案例而已

`MySQL`索引支持的数据结构：

- `B+Tree`类型：`MySQL`中最常用的索引数据结构，大部分的存储引擎都支持，而且是有序的
- `Hash`类型：大部分存储引擎都支持，在字段值不重复的情况下查询最快，无序的
- `R-Tree`类型：`MyISAM`引擎支持，也就是空间索引的默认结构类型
- `T-Tree`类型：`NDB-Cluster`引擎支持，主要用于`MySQL-Cluster`服务中

在上述的几种索引结构中，`B+Tree`和`Hash`索引是最常见的索引结构，几乎大部分存储引擎都实现了这两个索引结构，对于后面的这两种索引结构在特定的情况，特定的存储引擎中也是比较常见的，但是除了这四种索引结构之外，`MySQL`索引支持的数据结构还有`R*、R+、QR、SS、X`树等结构

因为我们最常用的存储引擎是`InnoDB和MyISAM`，又因为不同的存储引擎的索引结构是不同的，所以有一些我们没有听过索引结构是很正常的

> 在`MySQL架构篇`中提到过，存储引擎是可拨插式存储引擎，所以如果你自己有能力的话可以自己实现存储引擎，满足你自己的需求

在`MySQL`中创建索引的时候，默认的数据结构就是`B+Tree`，如何更换索引的数据结构呢？

> 就是在创建索引时，通过`using`关键字显式指定索引的数据结构`这个数据结构必须是当前使用的存储引擎支持的数据结构`
>
> ~~~sql
> CREATE INDEX indexName ON tableName (columnName(length) [ASC|DESC]) USING HASH;
> ~~~

同时索引还会被分为有序索引和无序索引，这是指索引文件中存储索引节点时，是否会按照字段值去进行排序，一个索引是有序的还是无序的由数据结构决定，例如`B+Tree、R-Tree`等树结构都是有序的，而哈希结构是无序的

----

## 字段数量层次

从表字段的层次来看，索引可以分为单列索引和多列索引，这两个称呼也比较好理解，单列索引是指索引是基于一个字段建立的，多列索引是指由多个字段组合建立的索引

单列索引也可以分为很多类型：

- 唯一索引：索引中的索引节点值不允许重复，一般配合唯一约束使用
- 主键索引：主键索引是一种特殊的唯一索引，和普通索引的区别在于不允许有空值
- 普通索引：通过`KEY、INDEX`关键字创建的索引就是这个类型，没啥限制，单纯可以让查询更快
- 还有很多，不阐述这么多了，只要是基于单个字段建立的索引都叫单列索引

多列索引是指由多个字段组合建立的索引

- 组合索引、联合索引、复合索引、多值索引都是多列索引

不管名称怎么改变，描述的含义都是相同的，即由多个字段组合建立的索引就是多列索引

> 在使用多列索引的时候需要注意：当建立多列索引后，一条`SELECT`语句，只有当查询条件中包含了多列索引的第一个字段的时才能使用多列索引，举个例子：

例如：用户表，通过`id、name、age`三个字段组成一个多列索引，那么在什么情况下才会使用索引呢，什么时候不会用呢

~~~sql
# 这个select语句就不会使用多列索引，因为，没有id字段，即不满足包含多列索引的第一个字段这个条件
select * from user_table where name = "JunLa" and age = "18";

# 这个select语句可以使用多列索引进行查询操作
select * from user_table where id = 1 and name = "JunLa";
~~~

所谓的按照字段数量进行分类，其实就是根据索引包含的字段数量来进行分类，是一个字段的索引还是多个字段的索引

但是不管是单列索引还是多列索引都会存在一个前缀索引的概念，前面创建索引中提到的`length`字段，使用一个字段值的前`N`个字符来创建出来的索引，就可以被称为前缀索引，前缀索引可以很大程度上节省索引文件的存储空间，提高索引性能

---

## 功能逻辑层次

> 在面试的时候可能会遇到一个问题：`MySQL`索引类型你知道哪些？
>
> 其实问的就是：`MySQL`索引从逻辑上可以划分成哪些类型，以功能逻辑划分索引类型，是最常见的划分方式，一般可以划分成5种：
>
> - 普通索引、唯一索引、主键索引、全文索引、空间索引

普通索引、唯一索引、主键索引前面都介绍过了，需要注意一下的是：主键字段上建立的索引被称为主键索引，非主键字段上建立的索引一般被称为辅助索引或二级索引或次级索引

全文索引和空间索引都是`MySQL5.7`版本后开始支持的索引类型，不过着两种索引只有`MyISAM`引擎支持

那么接下来重点看看全文索引和空间索引

### 全文索引

 全文索引类似于`ES、Solr`搜索中间件中的分词器，或者说和之前常用的`like+%`模糊查询很类似，它只能创建在`char、varchar、text`等这些文本类型字段上，而且使用全文索引查询时，条件字符数量必须大于`3`才生效，当然，还是举个例子：

~~~sql
+------------+--------------------------------------------+------------------+
| article_id | article_name                               | special_column   |
+------------+--------------------------------------------+------------------+
|          1 | MySQL架构篇：自顶向下深入剖析MySQL整体架构      | 《全解MySQL》    |
|          2 | MySQL执行篇：一条SQL语句从诞生至结束的历程      | 《全解MySQL》    |
|          3 | MySQL设计篇：数据库六范式与反范式设计准则！      | 《全解MySQL》    |
|          4 | MySQL索引篇：索引概述、分类及建立索引的原则      | 《全解MySQL》    |
+------------+--------------------------------------------+------------------+
~~~

例如：现在用户想对这张表进行查询，想查询`article_name`，但是忘记了文章全称，只记得`从诞生至结束`这个词汇，那么此时用户使用全文索引也能查询到对应的数据，所以就说和模糊查询很类似

后面再讲如何创建和使用全文索引

---

### 空间索引

空间索引用得不多，至少在大部分业务项目中用不到
首先我们得知道一个概念：`GIS`空间数据，`GIS`的意思是地理信息系统，这是一门新的学科，基于计算机、信息学、地理学等多科构建的，主要就是用于管理地理信息的数据结构，在国土、规划、出行、配送、地图等和地理有关的项目中、应用较为频繁

地理空间数据主要包含矢量数据、3D模型、坐标数据等，简单点说，空间数据就是可以将地理信息以模型的方式在地图上标注出来，在`MySQL`中总共支持`geometry、point、linestring、polygon`四种空间数据类型，而空间索引则是基于这些类型的字段建立的，也就是可以帮助我们快捷检索空间数据

空间索引还是了解即可，用的太少了

---

## 存储方式层次

从存储方式看，`MySQL`的索引主要分为两大类：

- 聚簇索引：也叫聚集索引、簇类索引
- 非聚簇索引：也叫非聚集索引、非簇类索引、二级索引、辅助索引、次级索引

我们可以想一想数组和链表的区别：

- 数组是物理空间上的连接，存储的所有元素都会按序存放在同一块内存区域中
- 链表是逻辑上的连续，存储的所有元素可能不在同一块内存，元素之间以指针连接

那么聚簇索引和非聚簇索引的区别也大致相同：

- 聚簇索引：逻辑上连续且物理空间上的连续
- 非聚簇索引：逻辑上连续，物理空间上不连续

当然，这里说的连续和数组的连续也不完全相同，因为索引大部分使用的是`B+Tree`结构存储，所以在磁盘中数据是以树结构存放的，所以连续并不是指索引节点，而是指索引数据和表数据，也就是说聚簇索引中，索引数据和表数据在磁盘中的位置是一起的，而非聚簇索引是分开的，索引节点和表数据之间用物理地址的方式维护两者的联系

一张表中只能存在一个聚簇索引，一般都会选用主键作为聚簇索引，其他字段上建立的索引都属于非聚簇索引，或者称之为辅助索引、次级索引。但是不要走进一个误区，虽然`MySQL`默认会使用主键上建立的索引作为聚簇索引，但也可以指定其他字段上的索引为聚簇索引，一般聚簇索引要求索引必须是非空唯一索引才行

> 其实就算表中没有定义主键，`InnoDB`中会选择一个唯一的非空索引作为聚簇索引，但如果非空唯一索引也不存在，`InnoDB`隐式定义一个主键来作为聚簇索引

主键或聚簇索引一般适合采用带有自增性的顺序值

---

# MySQL其他索引的创建使用方式

前面我们讲过三种创建索引的方式，分别是`create、alter、ddl`，在创建时可以通过`index、key`两个关键字创建，但这种方式建立的索引仅仅是普通索引

那么我们接下来就会讲解`MySQL`其他索引的创建和使用方式`但是不管是那种类型的索引，都可以通过前面说的三种方式来进行创建，只是不仅仅是使用index和key来进行创建而已`

## 唯一索引的创建和使用

唯一索引在创建时，需要通过关键字`unique`来创建

~~~sql
# 方式1
create unique index indexName on tableName (columnName(length));

# 方式2
alter table tableName add unique index indexName(columnName);

# 方式3
create table tableName(
    columnName1 int not null,
    columnName2 ....,
    columnName3 ....,
    ......,
    unique index [indexName] (columnName(length))
);
~~~



**注意：
对一个已经存在的表创建唯一索引的时候，如果选用的字段，在表中这个字段的值存在相同的值，那么这个唯一索引是无法创建的**

~~~sql
SELECT * FROM `article_table`;
+------------+--------------------------+-------------------+
| article_id | article_name             | special_column    |
+------------+--------------------------+-------------------+
|          1 | MySQL架构篇：.......     | 《全解MySQL》     |
|          2 | MySQL执行篇：.......     | 《全解MySQL》     |
|          3 | MySQL设计篇：.......     | 《全解MySQL》     |
|          4 | MySQL索引篇：.......     | 《全解MySQL》     |
|          5 | MySQL索引篇：.......     | 《全解MySQL》     |
+------------+--------------------------+-------------------+

CREATE UNIQUE INDEX i_article_name ON article_table (article_name);

# 这里是以字段article_name来创建唯一索引，但是会发现第4条和第5条数据是重复的，此时创建利用SQL语句创建唯一索引，就会抛出错误码1062
ERROR 1062 (23000): Duplicate entry 'MySQL索引篇：.......' for key 'i_article_name'

# 所以在这种情况下，只能先删除重复数据，确保选中的这个字段没有重复的数据，然后再去创建唯一索引
~~~



当唯一索引创建成功之后，它同时会对表具备唯一约束的作用，即使用`insert`语句去插入相同值的数据的时候，一样会抛出`1062`的错误码

~~~sql
INSERT INTO `article_table` VALUES(6,"MySQL索引篇：.......","《全解MySQL》");

1062 - Duplicate entry 'MySQL索引篇：.......' for key 'i_article_name'
~~~

---

## 主键索引的创建和使用

主键索引是特殊的唯一索引，主键索引是基于主键字段来进行创建的，主键缩影是通过`primary`关键字来创建的

~~~sql
# 方式1
alter table tableName add primary key indexName (columnName);

# 方式2
create table tableName (
    columnName1 int not null,
    columnName2 .....,
    columnName3.....,
    ....,
    primary key [indexName] columnName(length))
);
~~~

需要注意：

- 在创建主键索引的时候必须先把对应的字段设置成主键，然后再去创建主键索引，否则会报`1068`错误码
- 不能使用上面的第一种方式`create`语句来进行创建主键索引，否则会提示`1064`语法错误
- 同时创建索引时，关键字要换成`KEY`，不能用`INDEX`，否则也会提示语法错误

~~~sql
-- 对非主键字段创建主键索引
ALTER TABLE article_table ADD PRIMARY KEY i_special_column(special_column);
-- 报错信息如下：
1068 - Multiple primary key defined

-- 使用CREATE关键字创建主键索引
CREATE PRIMARY KEY i_article_id ON article_table (article_id);
-- 报错信息如下：
1064 - You have an error in your SQL syntax; check....

-- 使用INDEX关键字创建索引
ALTER TABLE article_table ADD PRIMARY INDEX i_article_id(article_id);
-- 报错信息如下：
1064 - You have an error in your SQL syntax; check....

-- 创建主键索引正确的方式
ALTER TABLE article_table ADD PRIMARY KEY i_article_id(article_id);

~~~

不过呢，一般我们都是在建表的`DDL`语句中创建主键索引，不会再表已经建好之后才去建立主键索引

我们不需要去考虑如何使用这些创建好的索引查询数据，因为在`MySQL执行篇`中查询语句的执行流程中，当`select`语句来到`MySQL`时，会经历优化器优化的过程，优化器就会帮我们选中一个最合适的索引查询数据，前提时查询条件中涉及带了索引字段才行

而且前面我们也说过，你不想用优化器来进行选择，你可以手动通过关键字`force index`来强制指定索引来进行查询，但是前提是你得要对业务系统足够熟悉

---

## 全文索引的创建和使用

如果想创建全文索引，那么`MySQL`的版本必须在`5.7`及以上，同时也需要自己手动指定，需要使用的关键字是`fulltest`：

~~~sql
# 方式1
alter table tableName add fulltext index indexName(columnName);

# 方式2
create fulltext index indexName on tableName(columnName);
~~~

注意：

- `5.6`版本的`MySQL`中存储引擎必须是`MyISAM`才能创建
- 创建全文索引的字段，这些字段必须是`char、varchar、text`等文本类型才能创建
- 如果想创建出的全文索引支持中文，需要在最好指定解析器:`with parser ngram`

还是以上面的文章表`article_table`为例子

~~~sql
ALTER TABLE 
    article_table ADD 
FULLTEXT INDEX 
    ft_article_name(article_name) 
WITH PARSER NGRAM;
~~~

当你创建好全文索引后，如果你想要使用全文索引时，优化器这时不能自动选择，因为全文索引有自己的语法，但在了解如何使用全文索引之前，要先了解两个概念：最小搜索长度和最大搜索长度

可以通过`show variables like ‘%ft%’;`命令查询，如下：

![全文索引参数](https://p6-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/15843b9707f6416bb5da7e7f22fe039f~tplv-k3u1fbpfcp-zoom-in-crop-mark:1512:0:0:0.awebp?)

介绍一下重点的参数：

- `ft_min_word_len`：使用`MyISAM`引擎的表中，全文索引最小搜索长度
- `ft_max_word_len`：使用`MyISAM`引擎的表中，全文索引的最大搜索长度
- `ft_query_expansion_limit`：`MyISAM`中使用`with query expansion`搜索的最大匹配数
- `innodb_ft_min_token_size`：`InnoDB`引擎的表中，全文索引最小搜索长度
- `innodb_ft_max_token_size`：`InnoDB`引擎的表中，全文索引的最大搜索长度

最大搜索长度和最小搜索长度是一个限制，即对于长度小于最小搜索长度和大于最大搜索长度的词语都无法触发全文索引，即无法使用全文索引，所以如果想使用全文索引对一个词语进行查询，那么这个词语的长度必须在这两个值之间

> 最大搜索长度和最小搜索长度这两个值是可以自己进行调整的
>
> 最小值可以手动调整成`1`，`MyISAM`引擎的最大值可以调整为`3600`
>
> `InnoDB`引擎的最大值是`84`（不确定，好像是的）

那么接下来我们就看一下如何使用全文索引来检索数据，全文索引专门有两个关键字`match(column)、against(关键字)`来进行检索，同时这两个检索函数还支持三种检索模式：

- 自然语言模式(默认的搜索模式)
- 布尔搜索模式
- 查询拓展模式

`match()`主要负责指定要搜索的列，这里要指定创建全文索引的字段，`against()`则指定要搜索的关键字，也就是要搜索的词语，接下来简单讲一下这三种搜索模式

### 自然语言模式

使用全文索引进行检索数据的时候，自然语言模式是默认的检索模式，使用方法：

~~~sql
+------------+--------------------------+-------------------+
| article_id | article_name             | special_column    |
+------------+--------------------------+-------------------+
|          1 | MySQL架构篇：.......     | 《全解MySQL》     |
|          2 | MySQL执行篇：.......     | 《全解MySQL》     |
|          3 | MySQL设计篇：.......     | 《全解MySQL》     |
|          4 | MySQL索引篇：.......     | 《全解MySQL》     |
+------------+--------------------------+-------------------+

SELECT 
    COUNT(article_id) AS '搜索结果数量' 
FROM 
    `article_table` 
WHERE 
    MATCH(article_name) AGAINST('MySQL');

-- 运行结果如下：
+--------------+
| 搜索结果数量 |
+--------------+
|           4 |
+--------------+
~~~

~~~sql
# 给定需要查询的关键字的长度小于默认的最小搜索长度，就无法使用全文索引，这条SQL就不会触发
SELECT 
    COUNT(article_id) AS '搜索结果数量' 
FROM 
    `article_table` 
WHERE 
    MATCH(article_name) AGAINST('M');

~~~

----

### 布尔搜索模式

布尔搜索模式有些特殊，因为这种搜索模式有自己的一个特定的搜索语法：

- `+`：表示必须匹配的行数据必须要包含相应的关键字
- `-`：和上面的`+`相反，表示匹配的数据不能包含相应的关键字
- `>`：提升指定关键字的相关性，在查询结果中靠前显式
- `<`：降低指定关键字的相关性，在查询结果中靠后显式
- `~`：表示允许出现指定关键字，但出现时相关性为负
- `*`：表示以该关键字开头的词语，如`A*`，可以匹配`A、AB、ABC....`
- `""`：双引号中的关键字作为整体，检索时不允许再分词
- `"X Y"@n`：`""`包含的多个词语之间的距离必须要在`n`之间，单位-字节，如：
  - `你 好@n10：表示你和好两个词语之间的距离要在`10`字节内

举个例子：

~~~sql
-- 查询文章名中包含 [MySQL] 但不包含 [设计] 的数据
SELECT 
    *
FROM 
    `article_table` 
WHERE 
    MATCH(article_name) AGAINST('+MySQL -设计' IN BOOLEAN MODE);

-- 查询文章名中包含 [MySQL] 和 [篇] 的数据，但两者间的距离不能超过10字节
SELECT 
    *
FROM 
    `article_table` 
WHERE 
    MATCH(article_name) AGAINST('"MySQL 篇"@10' IN BOOLEAN MODE);
    
-- 查询文章名中包含[MySQL] 的数据，
--    但包含 [执行] 关键字的行相关性要高于包含 [索引] 关键字的行数据
SELECT 
    *
FROM 
    `article_table` 
WHERE 
    MATCH(article_name) AGAINST('+MySQL +(>执行 <索引)' IN BOOLEAN MODE);

-- 查询文章名中包含 [MySQL] 的数据，但包含 [设计] 时则将相关性降为负
SELECT 
    *
FROM 
    `article_table` 
WHERE 
    MATCH(article_name) AGAINST('+MySQL ~设计' IN BOOLEAN MODE);

-- 查询文章名中包含 [执行] 关键字的行数据
SELECT 
    *
FROM 
    `article_table` 
WHERE 
    MATCH(article_name) AGAINST('执行*' IN BOOLEAN MODE);

-- 查询文章名中必须要包含 [MySQL架构篇] 关键字的数据
SELECT 
    *
FROM 
    `article_table` 
WHERE 
    MATCH(article_name) AGAINST('"MySQL架构篇"' IN BOOLEAN MODE);

~~~

最后的`IN BOOLEAN MODE`就是表示使用布尔搜索模式

相关性这个词：就是检索数据后，数据的优先级顺序，当相关性越高，对应数据的结果中越靠前，当相关性为负，则相应数据排到最后

---

### 查询拓展模式

查询拓展搜索就是对自然语言搜索模式的拓展，举例：

~~~sql
SELECT 
    COUNT(article_id) AS '搜索结果数量' 
FROM 
    `srticle_table` 
WHERE 
    MATCH(article_name) AGAINST('MySQL' WITH QUERY EXPANSION);

~~~

在自然语言模式的查询语句的基础上，最后面加上`WITH QUERY EXPANSION`表示使用查询拓展搜索，这种模式下会比自然语言模式多一次检索，以上面`SQL`语句为例：

- 首先会根据指定的关键字`MySQL`进行一次全文检索
- 然后第二阶段还会对指定的关键字进行分词，然后再进行一次全文检索

在介绍全文索引的参数时，有一个参数`ft_query_expansion_limit`，这个参数就是控制拓展搜搜哦时的拓展行数的，最大可以调整成`1000`，但是`Query Expansion`的全文检索带来许多非相关性的查询结果，所以需要谨慎使用

> 当全文索引引入`MySQL`之后，可以用来替代`like%`模糊查询，效率更高

---

## 空间索引的创建和使用

空间索引在业务系统中基本用不到，但是如果你要使用这个索引，可以通过关键字`spatial`创建,如下：

~~~sql
ALTER TABLE tableName ADD SPATIAL KEY indexName(columnName);
~~~

在创建空间索引的时候，注意：

- 目前`MySQL`常用引擎中，仅有`MyISAM`支持空间索引，所以表引擎必须用`MyISAM`
- 空间索引必须要建立在类型为`geometry、point、linestring、polygon`的字段上

---

## 联合索引的创建和使用

联合索引实际上不是一种逻辑索引分类，他是索引的一种特殊结构，前面给出的所有案例中，都仅仅是在单个字段的基础上建立索引，而联合索引的意思是可以使用多个字段建立索引，那该如何创建联合索引呢，不需要特殊关键字，如下：

~~~sql
# 方式1
CREATE INDEX indexName ON tableName (column1(length),column2...);

# 方式2
ALTER TABLE tableName ADD INDEX indexName(column1(length),column2...);

~~~

- 可以使用`index`关键字，让多个列组成一个普通联合索引
- 也可以使用`unique、index`关键字，让多个列组成一个唯一联合索引
- 甚至可以使用`fulltext idnex`关键字，让多个列组成一个全文联合索引

> 前面说过：`select`语句的查询条件中，必须包含组成联合索引的第一个字段，此时才会触发联合索引，否则无法使用联合索引

---

# 初始索引篇总结

对`MySQL`的索引机制有了一个全面的认知，包含索引概述、索引管理、索引分类、唯一、全文、联系、空间索引的创建和使用，下一篇将是索引篇的中-索引应用篇

